; domain
(define (domain drone_mission)

  ;; Specify required features
  (:requirements :strips :typing :equality :universal-preconditions)

  ;; Define types
  (:types
    support-drone - drone
    drone area station sensor - object
  )

  ;; Predicates
  (:predicates
    ;; Drone state and position
    (At ?d - drone ?p - area)
    (LastAt ?d - drone ?p - area)
    (HasSensor ?d - drone ?s - sensor)

    (HasEnergyHigh ?d - drone) ;; Indica se il drone ha energia alta
    (HasEnergyLow ?d - drone) ;; Indica se il drone ha energia bassa

    ;; Area state
    (DataCollected ?a - area ?s - sensor)
    (PriorityHigh ?a - area) ;; Indica se l'area ha priorita' alta
    (PriorityMedium ?a - area) ;; Indica se l'area ha priorita' media
    (PriorityLow ?a - area) ;; Indica se l'area ha priorita' bassa

    ;; Operational constraints
    (DynamicBlocked ?from - area ?to - area)
    (Adj ?from - area ?to - area)
  )

  ;; Action: Move with gradual energy consumption

  (:action MoveHighEnergy
    :parameters (?d - drone ?from - area ?to - area)
    :precondition (and
      (At ?d ?from)
      (Adj ?from ?to)
      (not (DynamicBlocked ?from ?to))
      (not (LastAt ?d ?to))
      (HasEnergyHigh ?d) ;; Manca questa precondizione
    )
    :effect (and
      (not (At ?d ?from))
      (At ?d ?to)
      (not (HasEnergyHigh ?d))
      (HasEnergyLow ?d) ;; Ora il drone ha energia bassa
    )
  )

  (:action MoveLowEnergy
    :parameters (?d - drone ?from - area ?to - area)
    :precondition (and
      (At ?d ?from)
      (Adj ?from ?to)
      (not (DynamicBlocked ?from ?to))
      (not (LastAt ?d ?to))
      (HasEnergyLow ?d) ;; Solo se il drone ha energia bassa
    )
    :effect (and
      (not (At ?d ?from))
      (At ?d ?to)
      (not (HasEnergyLow ?d)) ;; Dopo il movimento, il drone è scarico
    )
  )

  ;; Action: Collect data with priority constraints
  (:action CollectData
    :parameters (?d - drone ?a - area ?s - sensor)
    :precondition (and
      (At ?d ?a)
      (HasSensor ?d ?s)
      (not (DataCollected ?a ?s))
      (or (PriorityHigh ?a) (PriorityMedium ?a) (PriorityLow ?a))
    )
    :effect (and
      (DataCollected ?a ?s)
    )
  )

  ;; Action: Swap energy between drones with condition
  (:action RechargeDrone
    :parameters (?support - support-drone ?receiver - drone ?area - area)
    :precondition (and
      (At ?support ?area)
      (At ?receiver ?area)
      (not (HasEnergyHigh ?receiver)) ;; Il drone deve avere energia bassa o scarica
    )
    :effect (and
      (HasEnergyHigh ?receiver) ;; Il drone riceve energia alta
    )
  )

  ;; Action: Move support drone directly to the drone in need
  (:action MoveSupportDrone
    :parameters (?support - support-drone ?from - area ?to - area)
    :precondition (and
      (At ?support ?from) ;; Il drone deve essere da qualche parte prima di muoversi
      (exists
        (?receiver - drone)
        (and (At ?receiver ?to) (HasEnergyLow ?receiver)))
    )
    :effect (and
      (not (At ?support ?from)) ;; Rimuoviamo lo stato precedente
      (At ?support ?to) ;; Il drone si muove nella nuova area
    )
  )

  ;; Action: Clear a blocked dynamic path
  (:action ClearPath
    :parameters (?d - drone ?a - area ?s - sensor ?from - area ?to - area)
    :precondition (and
      (At ?d ?a) ;; Il drone deve essere nell'area dove raccoglie i dati
      (DataCollected ?a ?s) ;; I dati devono essere già stati raccolti
      (HasSensor ?d ?s) ;; Il drone deve avere il sensore giusto
      (DynamicBlocked ?from ?to) ;; Il percorso deve essere bloccato
      (or (HasEnergyHigh ?d) (HasEnergyLow ?d)) ;; Il drone deve avere energia
    )
    :effect (and
      (not (DynamicBlocked ?from ?to)) ;; Il passaggio viene sbloccato
      (not (DynamicBlocked ?to ?from)) ;; Il passaggio viene sbloccato anche in direzione opposta
      (not (HasEnergyLow ?d)) ;; Dopo aver liberato il passaggio, il drone è scarico
    )
  )
)

; problem
(define (problem drone_mission_3)
  (:domain drone_mission)

  ;; Objects in the problem
  (:objects
    drone1 drone2 - drone
    drone_support - support-drone
    area1 area2 area3 area4 area5 area6 area7 area8 area9 - area
    temp hum - sensor
  )

  ;; Initial state
  (:init
    ;; **Drone initial positions**
    (At drone1 area1)
    (At drone2 area3)
    (At drone_support area5)

    ;; **Energia iniziale**
    (HasEnergyHigh drone1)
    (HasEnergyHigh drone2)
    (HasEnergyHigh drone_support)

    ;; **Adiacenze**
    (Adj area1 area2)
    (Adj area2 area3)
    (Adj area4 area5)
    (Adj area5 area6)
    (Adj area7 area8)
    (Adj area8 area9)
    (Adj area1 area4)
    (Adj area2 area5)
    (Adj area3 area6)
    (Adj area4 area7)
    (Adj area5 area8)
    (Adj area6 area9)

    ;; **Bidirezionali**
    (Adj area2 area1)
    (Adj area3 area2)
    (Adj area5 area4)
    (Adj area6 area5)
    (Adj area8 area7)
    (Adj area9 area8)
    (Adj area4 area1)
    (Adj area5 area2)
    (Adj area6 area3)
    (Adj area7 area4)
    (Adj area8 area5)
    (Adj area9 area6)

    ;; **Blocked Paths**
    (DynamicBlocked area3 area6)
    (DynamicBlocked area6 area3)
    (DynamicBlocked area9 area6)
    (DynamicBlocked area6 area9)

    ;; **Sensor capabilities**
    (HasSensor drone1 temp)
    (HasSensor drone2 hum)

    ;; **Priority levels**
    (PriorityHigh area1)
    (PriorityMedium area2)
    (PriorityHigh area6)
    (PriorityLow area8)
  )

  ;; **Goals**
  (:goal
    (and
      (DataCollected area1 temp)
      (DataCollected area1 hum)
      (DataCollected area2 temp)
      (DataCollected area2 hum)
      (DataCollected area6 temp)
      (DataCollected area6 hum)
      (DataCollected area8 temp)
      (DataCollected area8 hum)
    )
  )
)

; plan
1. (collectdata drone1 area1 temp)
   added: (datacollected area1 temp)
   goals met: 1 of 8
2. (clearpath drone1 area1 temp area3 area6)
   deleted: (dynamicblocked area3 area6) (dynamicblocked area6 area3)
   goals met: 1 of 8
3. (movehighenergy drone1 area1 area2)
   deleted: (at drone1 area1) (hasenergyhigh drone1)
   added: (at drone1 area2) (hasenergylow drone1)
   goals met: 1 of 8
4. (collectdata drone1 area2 temp)
   added: (datacollected area2 temp)
   goals met: 2 of 8
5. (movehighenergy drone2 area3 area6)
   deleted: (at drone2 area3) (hasenergyhigh drone2)
   added: (at drone2 area6) (hasenergylow drone2)
   goals met: 2 of 8
6. (collectdata drone2 area6 hum)
   added: (datacollected area6 hum)
   goals met: 3 of 8
7. (movelowenergy drone2 area6 area5)
   deleted: (at drone2 area6) (hasenergylow drone2)
   added: (at drone2 area5)
   goals met: 3 of 8
8. (rechargedrone drone_support drone2 area5)
   added: (hasenergyhigh drone2)
   goals met: 3 of 8
9. (movehighenergy drone2 area5 area8)
   deleted: (at drone2 area5) (hasenergyhigh drone2)
   added: (at drone2 area8) (hasenergylow drone2)
   goals met: 3 of 8
10. (collectdata drone2 area8 hum)
   added: (datacollected area8 hum)
   goals met: 4 of 8
11. (movelowenergy drone2 area8 area5)
   deleted: (at drone2 area8) (hasenergylow drone2)
   added: (at drone2 area5)
   goals met: 4 of 8
12. (rechargedrone drone_support drone2 area5)
   added: (hasenergyhigh drone2)
   goals met: 4 of 8
13. (movehighenergy drone2 area5 area2)
   deleted: (at drone2 area5) (hasenergyhigh drone2)
   added: (at drone2 area2) (hasenergylow drone2)
   goals met: 4 of 8
14. (collectdata drone2 area2 hum)
   added: (datacollected area2 hum)
   goals met: 5 of 8
15. (movelowenergy drone2 area2 area1)
   deleted: (at drone2 area2) (hasenergylow drone2)
   added: (at drone2 area1)
   goals met: 5 of 8
16. (collectdata drone2 area1 hum)
   added: (datacollected area1 hum)
   goals met: 6 of 8
17. (movelowenergy drone1 area2 area5)
   deleted: (at drone1 area2) (hasenergylow drone1)
   added: (at drone1 area5)
   goals met: 6 of 8
18. (rechargedrone drone_support drone1 area5)
   added: (hasenergyhigh drone1)
   goals met: 6 of 8
19. (movehighenergy drone1 area5 area6)
   deleted: (at drone1 area5) (hasenergyhigh drone1)
   added: (at drone1 area6) (hasenergylow drone1)
   goals met: 6 of 8
20. (collectdata drone1 area6 temp)
   added: (datacollected area6 temp)
   goals met: 7 of 8
21. (movelowenergy drone1 area6 area5)
   deleted: (at drone1 area6) (hasenergylow drone1)
   added: (at drone1 area5)
   goals met: 7 of 8
22. (rechargedrone drone_support drone1 area5)
   added: (hasenergyhigh drone1)
   goals met: 7 of 8
23. (movehighenergy drone1 area5 area8)
   deleted: (at drone1 area5) (hasenergyhigh drone1)
   added: (at drone1 area8) (hasenergylow drone1)
   goals met: 7 of 8
24. (collectdata drone1 area8 temp)
   added: (datacollected area8 temp)
   goals met: 8 of 8
